<?php

echo "<h1>Ассоциативные массивы</h1>";

$books = array(
                "Рэй Брэдбери" => "451° по Фаренгейту",
                "Рэй Брэдбери" => "Вино из одуванчиков",
                "Грегори Дэвид Робертс" => "Шантарам",
                "Грегори Дэвид Робертс" => "Тень горы",
                "Джордж Оруэлл" => "1984",
                "Михаил Булгаков" => "Мастер и Маргарита",
                "Эрих Мария Ремарк" => "Три товарища",
                "Оскар Уайльд" => "Портрет Дориана Грея",
                "Дэниел Киз" => "Цветы для Элджернона",
                "Джером Дейвид Сэлинджер" => "Над пропастью во ржи",
                "Антуан де Сент-Экзюпери" => "Маленький принц",
                "Лев Толстой" => "Анна Каренина",
                "Габриэл Гарсиа Маркес" => "Сто лет одиночества",
                "Айн Рэнд" => "Атлант расправил плечи"
            );

echo "<ul>";
foreach ($books as $bookAuthor => $bookTitle){
    echo "<li> $bookAuthor '$bookTitle' <br><br> </li>";
}
echo "</ul>";

?>
